/**/
"Cancel" = "إلغاء";
/**/
"Delete" = "حذف";
/**/
"Open" = "فتح";
/**/
"Edit" = "تحرير";
/**/
"Yes" = "نعم";

/*Geometry Edit Action Name*/
"Apply Geometry" = "تطبيق الشكل الهندسي";
/*Geometry Edit Action Name*/
"Clear Geometry" = "مسح الشكل الهندسي";
/*Geometry Edit Action Name*/
"Delete Vertex" = "حذف النقطة القممية";
/*Geometry Edit Action Name*/
"Insert Part" = "إدراج جزء";
/*Geometry Edit Action Name*/
"Insert Vertex" = "إدراج نقطة قممية";
/*Geometry Edit Action Name*/
"Move Vertex" = "تحريك النقطة القممية";
/*Geometry Edit Action Name*/
"Remove Part" = "إزالة جزء";

/*Collecting attachments*/
"Add" = "إضافة";
/*Collecting attachments*/
"Take Photo or Video" = "التقاط صورة أو فيديو";
/*Collecting attachments*/
"Choose From Library" = "اختيار من المكتبة";
/*Collecting attachments*/
"Photo" = "صورة";
/*Collecting attachments*/
"Video" = "فيديو";
/*Collecting attachments*/
"Save To Photo Library" = "حفظ إلى مكتبة الصور";
/*Collecting attachments*/
"Download" = "تحميل";

/*Date attribute*/
"Today" = "اليوم";

/**/
"Attachments" = "المرفقات";
"Attributes" = "السمات";

/**/
"Open in Safari" = "فتح في Safari";

/* Please enter a numeric value between 0 and 5.*/
"RangeValueMessageInt" = "إدخل رقمًا بين %i و%i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"RangeValueMessageFloat" = "إدخل رقمًا بين %f و %f.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"StringLengthError" = "حروف كثيرة جدًا (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "الرقم يقع خارج النطاق المسموح به.";

/* BLOB, RASTER, etc */
"Field type not supported" = "نوع الحقل غير مدعوم.";

/**/
"CurrentPageOfNumberOfPagesFormatString" = "%d من %d";

/**/
"ChangingFeatureTypeAlertTitle" = "يتم الآن تغيير نوع الميزة";
"ChangingFeatureTypeAlertMessage" =  "أنت تقوم الآن بتغيير نوع الميزة، والتي من المحتمل أن تؤدي للكتابة فوق قيم الحقل. هل ترغب بالفعل في القيام بذلك؟";

/**/
/*Text for pie chart when data is invalid*/
"Data for pie chart is invalid" = "بيانات المخطط الدائري غير صحيحة";

/* Text for pie chart when no data is available */
"No data to create a pie chart" = "لا توجد بيانات لإنشاء مخطط دائري";